#+STARTUP: indent
#+TITLE: DotDict

* Usage
#+BEGIN_VERSE
主要用于从客户端读取Json数据之后把客户端的数据变成一个 DotDict 方便后序使用
obj = DotDict(key1=value1, key2=value2...)
obj.key3 = value3
#+END_VERSE

#+BEGIN_SRC python :results output
  from dotdict import DotDict

  obj = DotDict()
  obj.name = "inmove"
  obj.age = 18
  obj.jobs = ["1", "2"]
  obj.works = [{"name": "1", "hours": 2, "contents": ["123", "321"]}]
  obj.a.b.c = obj.works
  print(obj.to_dict())
#+END_SRC

#+RESULTS:
: {'name': 'inmove', 'age': 18, 'jobs': [['1'], ['2']], 'works': [{'name': '1', 'hours': 2, 'contents': [['1', '2', '3'], ['3', '2', '1']]}], 'a': {'b': {'c': [{'name': '1', 'hours': 2, 'contents': [['1', '2', '3'], ['3', '2', '1']]}]}}}
* Exceptions
#+BEGIN_VERSE
1. 只支持 list, dict, str, int, float, bool, tuple, set, DotDict 数据类型
2. 只有 DotDict 可以使用 to_dict函数.如上 obj.age.to_dict将会报错,因为 obj.age 是int类型的
#+END_VERSE
